In [8]:
#data things
import numpy as np
import pandas as pd

#to evaulate
from sklearn.metrics import classification_report

#my own py files
import acquire as a
import prepare as p

#new imports! 
#for classification
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier #pick the classifier one

In [9]:
# prep includes acquire function
df_titanic=p.prep_titanic()

In [3]:
df_titanic.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone
0,0,0,3,male,1,0,7.2500,Southampton,0
1,1,1,1,female,1,0,71.2833,Cherbourg,0
2,2,1,3,female,0,0,7.9250,Southampton,1
3,3,1,1,female,1,0,53.1000,Southampton,0
4,4,0,3,male,0,0,8.0500,Southampton,1

Pre-Process Data

In [4]:
train, validate, test= p.split_data(df_titanic,'survived')

In [5]:
train.head()

,passenger_id,survived,pclass,sex,sibsp,parch,fare,embark_town,alone
776,776,0,3,male,0,0,7.7500,Queenstown,1
829,829,1,1,female,0,0,80.0000,Southampton,1
215,215,1,1,female,1,0,113.2750,Cherbourg,0
258,258,1,1,female,0,0,512.3292,Cherbourg,1
129,129,0,3,male,0,0,6.9750,Southampton,1

In [6]:
train.shape

(534, 9)

In [7]:
validate.shape

(178, 9)

In [25]:
test.shape

(179, 9)

Establish a Baseline

In [29]:
train.survived.value_counts(normalize=True)

survived
0    0.616105
1    0.383895
Name: proportion, dtype: float64

In [35]:
# put target variable into variables for train, validate, & test splits.
y_train = train.survived
y_validate = validate.survived
y_test = test.survived

763    1
112    0
230    1
500    0
237    1
      ..
883    0
149    0
843    0
581    1
214    0
Name: survived, Length: 179, dtype: int64